In [56]:
import pandas as pd
import matplotlib.pyplot as plt 
%matplotlib inline 
import seaborn as sns #--> aliases

In [31]:
#reading csv using pandas
comdf = pd.read_csv("/Users/ganesh/troondx/Learning/IDS13/Hackathon/company.csv")

In [32]:
#analysing data 
print(comdf.head(10))
# print("\nShape of data")
# print(comdf.shape)
# print("\ncolumns of data")
# print(comdf.columns)
print("\n Schema of data")
print(comdf.info())
print("\n Description of data")
print(comdf.describe())

   Company   Age  Salary     Place Country  Gender
0      TCS  20.0     NaN   Chennai   India       0
1  Infosys  30.0     NaN    Mumbai   India       0
2      TCS  35.0  2300.0  Calcutta   India       0
3  Infosys  40.0  3000.0     Delhi   India       0
4      TCS  23.0  4000.0    Mumbai   India       0
5  Infosys   NaN  5000.0  Calcutta   India       0
6      TCS   NaN  6000.0   Chennai   India       1
7  Infosys  23.0  7000.0    Mumbai   India       1
8      TCS  34.0  8000.0  Calcutta   India       1
9      CTS  45.0  9000.0     Delhi   India       0

 Schema of data
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148 entries, 0 to 147
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Company  140 non-null    object
 1   Age      130 non-null    float64
 2   Salary   124 non-null    float64
 3   Place    134 non-null    object
 4   Country  148 non-null    object
 5   Gender   148 non-null    int64
dtypes: float64(2), int64(1), object(3)
memory usage: 7.1+ KB
None

 Description of data
              Age       Salary      Gender
count  130.000000   124.000000  148.000000
mean    30.484615  5312.467742    0.222973
std     11.096640  2573.764683    0.417654
min      0.000000  1089.000000    0.000000
25%     22.000000  3030.000000    0.000000
50%     32.500000  5000.000000    0.000000
75%     37.750000  8000.000000    0.000000
max     54.000000  9876.000000    1.000000

In [33]:
comdf.isna().sum()

Company     8
Age        18
Salary     24
Place      14
Country     0
Gender      0
dtype: int64

In [55]:
# data preprocessing
# Fill rows without company name, Age, Salary and Place
comdf["Company"].fillna("Unknown Company", inplace = True)
comdf['Age'].fillna(comdf['Age'].mean(), inplace=True)
comdf['Salary'].fillna(comdf['Salary'].mean(), inplace=True)
comdf['Place'].fillna("Unknow Place", inplace=True)
comdf.isna().sum()

Company    0
Age        0
Salary     0
Place      0
Country    0
Gender     0
dtype: int64

In [59]:
# Unique company names
comdf.Company.unique()

array(['TCS', 'Infosys', 'CTS', 'Unknow Company',
       'Tata Consultancy Services', 'Congnizant', 'Infosys Pvt Lmt'],
      dtype=object)

In [65]:
# Average salary of employees in company
#print(comdf.groupby('Company').mean())
print("Average salary of employees in company")
comdf.groupby('Company').agg({'Salary':np.mean})

Average salary of employees in company

                                Salary
Company
CTS                        4897.448477
Congnizant                 2934.000000
Infosys                    5202.086022
Infosys Pvt Lmt            8202.000000
TCS                        5472.845405
Tata Consultancy Services  8345.000000
Unknow Company             5852.550403

In [67]:
# Average age of employees in company
print("Average Age of employees in company")
comdf.groupby('Company').agg({'Age':np.mean})

Average Age of employees in company

                                 Age
Company
CTS                        32.194444
Congnizant                 21.500000
Infosys                    32.241709
Infosys Pvt Lmt            21.500000
TCS                        28.752395
Tata Consultancy Services  33.500000
Unknow Company             28.121154

In [92]:
# Total Number of employees in company
print("Total Number of employees in company")
resultdf=comdf.groupby(comdf['Company']).count()[['Gender']]
resultdf.rename(columns={"Gender": "Count"})

Total Number of employees in company

                           Count
Company
CTS                           36
Congnizant                     2
Infosys                       45
Infosys Pvt Lmt                2
TCS                           53
Tata Consultancy Services      2
Unknow Company                 8

In [108]:
# Average salary by Company and City
print("Average salary by Company and City")
avgsaldf=comdf.groupby(['Company','Place']).agg({'Salary':np.mean})
print(avgsaldf)

Average salary by Company and City
                                             Salary
Company                   Place
CTS                       Calcutta      3771.419355
                          Chennai       4685.155914
                          Cochin        2903.366935
                          Delhi         9142.000000
                          Hyderabad     5448.822581
                          Mumbai        4268.541219
                          Noida         1089.000000
                          Podicherry    5659.000000
                          Pune          7156.233871
                          Unknow Place  8157.489247
Congnizant                Mumbai        2934.000000
                          Noida         2934.000000
Infosys                   Bhopal        7000.000000
                          Calcutta      5626.769795
                          Chennai       4756.666667
                          Cochin        6578.600000
                          Delhi         3760.744624
                          Hyderabad     4072.666667
                          Mumbai        4993.085044
                          Noida         5098.000000
                          Podicherry    3030.000000
                          Unknow Place  6734.000000
Infosys Pvt Lmt           Chennai       8202.000000
                          Mumbai        8202.000000
TCS                       Calcutta      5418.266749
                          Chennai       6288.822581
                          Cochin        5360.500000
                          Delhi         4338.000000
                          Hyderabad     3045.000000
                          Mumbai        5219.071960
                          Nagpur        8000.000000
                          Noida         5089.366935
                          Unknow Place  6584.666667
Tata Consultancy Services Mumbai        8345.000000
                          Unknow Place  8345.000000
Unknow Company            Calcutta      4383.233871
                          Chennai       8943.000000
                          Delhi         5312.467742
                          Hyderabad     5312.467742
                          Mumbai        3000.000000
                          Noida         6543.000000
                          Unknow Place  8943.000000

In [126]:
# Number of male and female employee
print("Number of male and female salary by Company and City")
maledf = comdf[comdf["Gender"] == 1]
print("Male employee")
print(maledf.count()[['Company']]) 

femaledf = comdf[comdf["Gender"] == 0]
print("FeMale employee")
print(femaledf.count()[['Company']])

Number of male and female salary by Company and City
Male employee
Company    33
dtype: int64
FeMale employee
Company    115
dtype: int64